app/views/users/show.html.erb

SELECT  1 AS one FROM "tweets" WHERE "tweets"."user_id" = $1 LIMIT 1  [["user_id", 107]]
---

    <% if @user.tweets.any? %>