app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 107]]
---
<span><%= link_to "view my profile", current_user %></span>
<span class="text"><%= pluralize(current_user.tweets.count, "tweet") %></span>