app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" LIMIT 30 OFFSET 0
---
  def index
    @search = Group.search(params[:q])
    @groups = @search.result.paginate(page: params[:page])

SELECT "grouprels"."group_id" FROM "grouprels" WHERE "grouprels"."user_id" = $1  [["user_id", 101]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 30 OFFSET 0
---
  def manage
    user_id = session[:user_id]
    @group_ids = Grouprel.where(user_id: user_id).pluck(:group_id)
    @groups = Group.where(id: @group_ids).paginate(page: params[:page])