app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @tweet = current_user.tweets.build
      @feed_items = current_user.feed.paginate(page: params[:page])
      @groupi = Grouprel.where(user_id: current_user.id).pluck(:group_id)
      @groupies = Group.where(id: @groupi).paginate(page: params[:page])
      @hashtags = Hashtag.all.last(5)
      @suggested = candidates(current_user)
      @candidate = Suggested.where(owner: current_user.id).pluck(:user_id)
      @suggested2 = User.where(id: @candidate)
---
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 107]]
SELECT "grouprels"."group_id" FROM "grouprels" WHERE "grouprels"."user_id" = $1  [["user_id", 107]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "grouprels" WHERE "grouprels"."user_id" = $1 AND "grouprels"."group_id" = $2  [["user_id", 101], ["group_id", 1]]
SELECT "suggesteds"."user_id" FROM "suggesteds" WHERE "suggesteds"."owner" = $1  [["owner", 107]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 106]]