app/controllers/tweets_controller.rb

  def create
    @tweet = current_user.tweets.build(tweet_params)
    if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "wdafev"], ["user_id", 101], ["created_at", "2015-05-25 08:59:40.912712"], ["updated_at", "2015-05-25 08:59:40.912712"]]

  def destroy
    @retweets = Tweet.where(original_tweet_id: @tweet.id)

    @retweets.each do |retweet|
      retweet.destroy
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."original_tweet_id" = $1  ORDER BY "tweets"."created_at" DESC  [["original_tweet_id", 123]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 123]]