app/controllers/users_controller.rb

  def index
    @search = User.search(params[:q])
    @users = @search.result.paginate(page: params[:page],per_page: 10)
---
SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @tweets = @user.tweets.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 107]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  ORDER BY "tweets"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 101]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 101]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "confirmation_code") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def confirm
    user = User.find(params[:id])
    if user.confirmation_code == params[:confirmation_code]
      user.activated = true
      user.confirmation_code = nil
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 107]]
UPDATE "users" SET "activated" = $1, "confirmation_code" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["activated", "t"], ["confirmation_code", nil], ["updated_at", "2015-05-04 14:58:34.889333"], ["id", 107]]

  def suggest
    @suggested2 = candidates2(current_user)

    Suggested.where(owner: current_user.id).delete_all
    @suggested2.each do |user|
       @new_suggest = Suggested.new
       @new_suggest.user_id = user.id
       @new_suggest.owner = current_user.id
       @new_suggest.save
---
DELETE FROM "suggesteds" WHERE "suggesteds"."owner" = $1  [["owner", 101]]
INSERT INTO "suggesteds" ("user_id", "owner", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["owner", 101], ["created_at", "2015-05-27 09:02:56.997893"], ["updated_at", "2015-05-27 09:02:56.997893"]]